[
  {
    "id": "mjsr0is8wuzh84n5re",
    "title": "State-Level Recognition at Teachers’ Day Expo",
    "description": "September 5 | Shilpakala Vedika, Hyderabad\nOn the occasion of Teachers’ Day (September 5), FEEDX Polytechnic had the opportunity to\nshowcase its project FX BOT – Smart Feedback and Issue Management System at the\nTeachers’ Day Stall Expo organized by the Department of Technical Education, Telangana,\nheld at Shilpakala Vedika, Hyderabad.\nThe Expo was conducted alongside the address of Hon’ble Chief Minister Sri Revanth Reddy\non the future of education in Telangana, bringing together educators, officials, and innovators\nfrom across the state.\n\nA proud highlight of the event was the support and encouragement extended to FX BOT by\nSmt. Sri Devasena Ma’am, IAS, Commissioner of Technical Education, recognizing the\nimportance of student-led innovation and transparent feedback mechanisms.\nThis recognition marks an important milestone in the FEEDX journey and reinforces our\ncommitment to innovation, accountability, and building meaningful solutions for polytechnic\nstudents.",
    "images": [
      "/uploads/images/1767108893514-817146565.jpg",
      "/uploads/images/1767108897431-933753626.jpg",
      "/uploads/images/1767108899641-102059620.jpg"
    ],
    "timestamp": "2025-12-30T15:35:01.400Z"
  },
  {
    "id": "mjsoex9zlmcvkwveck",
    "title": "Principal’s Conclave of Government Polytechnics",
    "description": "Recognition at MCR HRD Institute\nNovember 1, 2025 | MCR HRD Institute, Hyderabad\nThe FEEDX Polytechnic Community had the honor of presenting FX BOT (Pilot Version of\nthe FEEDX Project) at the Principal’s Conclave of Government Polytechnics, held at the\nMCR HRD Institute.\nThe presentation took place in the esteemed presence of Dr. Yogita Rana, IAS and Smt. A. Sri\nDevasena, IAS, Commissioner of Collegiate & Technical Education, marking a significant\nmilestone for the Government Institute of Electronics, Secunderabad, and the FEEDX\ninitiative.\nThe conclave witnessed the participation of Principals from all 59 Government Polytechnic\nColleges across Telangana. A proud highlight of the event was the special recognition given\nto the FX BOT project, acknowledging its relevance, impact, and potential in strengthening\ntransparency and student feedback systems.\nDuring her address, Smt. A. Sri Devasena, IAS, spoke about the FEEDX initiative and FX BOT\nas part of her speech, referencing the project in front of all attending principals — a moment of\nstrong validation for student-led innovation within the technical education system.\nThis recognition further strengthens our commitment to building impact-driven,\nstudent-centric solutions and marks another important step forward in the FEEDX journey.",
    "images": [
      "/uploads/images/1767104490272-183770294.jpg",
      "/uploads/images/1767104496362-548551263.jpg",
      "/uploads/images/1767104496705-198084661.jpg",
      "/uploads/images/1767104497168-996948988.jpg",
      "/uploads/images/1767104497928-297649563.jpg"
    ],
    "timestamp": "2025-12-30T14:22:14.519Z"
  }
]